### Sütun İçerisindeki Değerleri Ayırıp Satırlara Yazmak

**Kaynak**

[Split text in a column into multiple lines](https://programmer.ink/think/pandas-how-do-i-split-text-in-a-column-into-multiple-lines-python.html?utm_source=pocket_mylist)

**Problem**

Sütun içerisinde yanyana virgülle veya - ile yanyana gelmiş string değerleri ayırıp aynı satır tekrar edecek şekilde satırlara yazmak istiyoruz.

In [1]:
import pandas as pd

df = pd.DataFrame({'Country':['China','US','Japan','EU','UK/Australia', 'UK/Netherland'],
               'Number':[100, 150, 120, 90, 30, 2],
               'Value': [1, 2, 3, 4, 5, 6],
               'label': list('abcdef')})

In [2]:
df.head()

        Country  Number  Value label
0         China     100      1     a
1            US     150      2     b
2         Japan     120      3     c
3            EU      90      4     d
4  UK/Australia      30      5     e

In [3]:
df.drop('Country', axis=1).join(df['Country'].str.split('/', expand=True).stack().reset_index(level=1, drop=True).rename('Country'))

   Number  Value label     Country
0     100      1     a       China
1     150      2     b          US
2     120      3     c       Japan
3      90      4     d          EU
4      30      5     e          UK
4      30      5     e   Australia
5       2      6     f          UK
5       2      6     f  Netherland